In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
semana = input("Ingrese Semana: ")

Ingrese Semana: 40-2

# Carga de Datos

In [3]:
mainpath = "C:/Users/mromo/Desktop/Rappi/Datasets/S"+semana+"/Data"
ganancias_path = "Detalle Ganancia S"+semana+".csv"
deuda_path = "Detalle Deuda S"+semana+".csv"
dmanual_path = "Deuda Manual S"+semana+".csv"
garantias_path = "Garantias Semanales.xlsx"
conexion_path = "Info Conexion.csv"
incentivos_path = "Incentivos Sem "+semana+".xlsx"

fp_earn = os.path.join(mainpath,ganancias_path)
fp_debt = os.path.join(mainpath,deuda_path)
fp_mandebt = os.path.join(mainpath,dmanual_path)
fp_garantias = os.path.join(mainpath,garantias_path)
fp_incentivos = os.path.join(mainpath,incentivos_path)
fp_conexion = os.path.join(mainpath,conexion_path)

# Data Frames

In [4]:
df_earn = pd.read_csv(fp_earn, parse_dates = ['created_at'])
df_debt = pd.read_csv(fp_debt, parse_dates = ['created_at'])
df_mandebt= pd.read_csv(fp_mandebt, parse_dates = ['created_at'])
#df_bonus25 = pd.read_excel(fp_incentivos, sheet_name = 'P25')
#df_bonus60 = pd.read_excel(fp_incentivos, sheet_name = 'P60')
#df_vBonus = pd.read_excel(fp_incentivos, sheet_name = 'Incentivos por Dia')
df_conexion = pd.read_csv(fp_conexion, parse_dates = ['fecha'])

In [5]:
ids_vina = [10440, 12061, 12062, 12064, 12065, 12066, 12068, 12081,12082,12083,12084,12085,12086,12088,12391,12096,
12098,12097,12099,12138,12140,12141,12142,12208,12145,12212,12209,12211,12244,12241,12242,12250,
12249,12243,12247,12248,12246,12245,12253,12254,12302,12319,12326,12325,12310,12460]
df_vina = df_conexion[df_conexion['skid'].isin(ids_vina)]

df_bonus25 = df_bonus25.fillna(0)
df_bonus60 = df_bonus60.fillna(0)
df_conexion = df_conexion.fillna(0)

In [6]:
df_earn = df_earn[df_earn['storekeeper_id']!=48]
df_earn = df_earn[df_earn['storekeeper_id']!=12060]

In [7]:
df_earn.head(10)

,storekeeper_id,created_at,name,model_id,total,description
0,10042,2018-10-06 12:54:17.416,service_cost,265236,1400.0,NaN
1,10042,2018-10-06 12:54:17.448,surcharge_paid_for_rappi,265236,100.0,NaN
2,10042,2018-10-06 13:25:30.721,service_cost,265362,1400.0,NaN
3,10042,2018-10-06 13:57:42.251,service_cost,265714,1400.0,NaN
4,10042,2018-10-06 14:42:13.668,service_cost,266092,1400.0,NaN
5,10042,2018-10-06 14:42:13.691,surcharge_paid_for_rappi,266092,75.0,NaN
6,10042,2018-10-06 15:21:44.181,service_cost,266534,1400.0,NaN
7,10042,2018-10-06 15:21:44.203,tip,266534,1000.0,NaN
8,10042,2018-10-06 15:57:15.274,service_cost,266646,1400.0,NaN
9,10042,2018-10-06 17:38:34.712,service_cost,267737,1400.0,NaN

In [8]:
df_conexion.head(10)

   skid      fecha  hora      time  orders  ganancia tenia_cupo
0     1 2018-10-04     0  1.450000     NaN       NaN         No
1     1 2018-10-04     1  1.833333     NaN       NaN         No
2     1 2018-10-04     2  1.450000     NaN       NaN         No
3     1 2018-10-04     3  1.550000     NaN       NaN         No
4     1 2018-10-04     4  1.466667     NaN       NaN         No
5     1 2018-10-04     5  1.400000     NaN       NaN         No
6     1 2018-10-04     6  1.483333     NaN       NaN         No
7     1 2018-10-04     7  1.533333     NaN       NaN         No
8     1 2018-10-04     8  1.883333     NaN       NaN         No
9     1 2018-10-04     9  1.950000     NaN       NaN         No

df_bonus25 = df_bonus25.set_index('Inicio')
df_bonus60 = df_bonus60.set_index('Inicio')

# Garantias Dias

In [9]:
#Dataframes por Dia
df_sab = df_conexion[df_conexion['fecha']=='2018-10-06']
df_dom = df_conexion[df_conexion['fecha']=='2018-10-07']

In [10]:
df_sab = df_sab[df_sab['skid']!=1]
df_dom = df_dom[df_dom['skid']!=1]

In [11]:
df_garDias = pd.merge(df_sab,df_dom,how='outer', on='skid')
df_garDias = df_garDias.fillna(0)

df_hSab1 = df_sab[df_sab['hora']>=9]
df_hSab2 = df_sab[df_sab['hora']<=12]
df_hSab = pd.merge(df_hSab1, df_hSab2, how ='inner', 
                      on=['hora','skid','time','orders','ganancia','tenia_cupo','fecha'])
df1 = df_hSab.groupby('skid').orders.sum()
df1 = pd.DataFrame(df1)
df_gSab1 = df1[df1['orders']>2]

df_hDom1 = df_dom30[df_dom30['hora']>=9]
df_hDom2 = df_dom30[df_dom30['hora']<=12]
df_hDom = pd.merge(df_hDom1, df_hDom2, how ='inner', 
                      on=['hora','skid','time','orders','ganancia','tenia_cupo','fecha'])
df1 = df_hDom.groupby('skid').orders.sum()
df1 = pd.DataFrame(df1)
df_gDom1 = df1[df1['orders']>2]

df_gDias = pd.merge(df_gSab1,df_gDom1, how ='outer', on ='skid')
df_gDias = df_gDias.fillna(0)

# Totales

In [12]:
df_debt[df_debt['name'].str.startswith("order")]

,dispersion_id,storekeeper_id,created_at,name,model_id,total
0,328490,10702,2018-10-04 00:01:48.878,order_not_delivered_manual_debt,5288,-47400.0
38,328791,12000,2018-10-04 10:11:58.835,order_not_delivered_manual_debt,5290,-10490.0
1210,333221,10944,2018-10-04 18:04:45.112,order_not_delivered_manual_debt,5303,-38758.0
1234,333456,11262,2018-10-04 18:40:01.169,order_not_delivered_manual_debt,5304,-15880.0
1575,338970,11262,2018-10-05 14:35:02.313,order_not_delivered_manual_debt,5350,-13980.0
1867,341500,10640,2018-10-05 18:36:42.113,order_not_delivered_manual_debt,5361,-3600.0
3955,362141,10894,2018-10-08 21:18:23.616,order_not_delivered_manual_debt,5401,-42160.0

In [13]:
df_calcGarantias = df_conexion
df_resumen = df_conexion
df_resumen = df_resumen.drop(labels = ['hora'], axis =1)

In [14]:
dias_trabajados = df_resumen.groupby(['skid','fecha'])

In [15]:
#Totales Minutos, Ganancias, etc
df_resumen = df_resumen.groupby('skid').sum()

In [16]:
df_calcGarantias.head(10)

   skid      fecha  hora      time  orders  ganancia tenia_cupo
0     1 2018-10-04     0  1.450000     NaN       NaN         No
1     1 2018-10-04     1  1.833333     NaN       NaN         No
2     1 2018-10-04     2  1.450000     NaN       NaN         No
3     1 2018-10-04     3  1.550000     NaN       NaN         No
4     1 2018-10-04     4  1.466667     NaN       NaN         No
5     1 2018-10-04     5  1.400000     NaN       NaN         No
6     1 2018-10-04     6  1.483333     NaN       NaN         No
7     1 2018-10-04     7  1.533333     NaN       NaN         No
8     1 2018-10-04     8  1.883333     NaN       NaN         No
9     1 2018-10-04     9  1.950000     NaN       NaN         No

In [17]:
df_calcGarantias.insert(6,"Total Pedidos",0)

In [18]:
df_calcGarantias.insert(7,"garantia horas",0)

In [19]:
df_calcGarantias.insert(8,"garantia especial",0)

In [20]:
#df con horas para garantia
df_calcGarantias = df_calcGarantias.fillna(0)

In [21]:
dias_trabajados = dias_trabajados.sum().reset_index()

In [22]:
#Suma total Dias Trabajados por RT
dtrab = dias_trabajados.groupby('skid').fecha.count()
dtrab.head(10)

skid
1        5
10042    1
10045    1
10047    4
10048    5
10057    1
10059    5
10061    4
10065    4
10066    5
Name: fecha, dtype: int64

In [23]:
df_mandebt = df_mandebt.sort_values('storekeeper_id',ascending = True)
df_mandebt['amount'] = df_mandebt['amount'].astype(int)

In [24]:
df_debt = df_debt.sort_values('storekeeper_id',ascending = True)
df_debt['total'] = df_debt['total'].astype(int)

In [25]:
df_debt[df_debt['storekeeper_id']== 10042]

,dispersion_id,storekeeper_id,created_at,name,model_id,total
2294,348832,10042,2018-10-06 17:38:34.697,cash_base,267737,-347
62,329027,10042,2018-10-04 11:46:08.989,debt_by_balance,14,-1175

In [26]:
df_earn = df_earn.sort_values('storekeeper_id',ascending = True)
df_earn['total'] = df_earn['total'].astype(int)

In [27]:
df_earn.columns

Index(['storekeeper_id', 'created_at', 'name', 'model_id', 'total',
       'description'],
      dtype='object')

In [28]:
df_incentivos = pd.DataFrame(df_earn.groupby('description').total.sum())

In [29]:
df_incentivos

                             total
description
03 Oct -Miercoles 12 a 15    28000
03 Oct -Miercoles 8 a 12     96000
10 Oct - Domingo 9 a 12       8000
11 Oct - Domingo 9 a 12       8000
12 Oct - Domingo 9 a 12       8000
12094                        30000
12192                        30000
12232                        30000
13 Oct - Domingo 9 a 12       8000
14 Oct - Domingo 9 a 12       8000
15 Oct - Domingo 9 a 12       8000
16 Oct - Domingo 9 a 12       8000
17 Oct - Domingo 9 a 12       8000
18 Oct - Domingo 9 a 12       8000
3 Oct -Miercoles 12 a 15    700000
3 Oct -Miercoles 19 a 22   1008000
5 Oct - Viernes 12 a 15    1694000
5 Oct - Viernes 13 a 15     119000
5 Oct - Viernes 19 a 22    1644000
5 Oct - Viernes 8 a 12      256000
6 Oct - Sabado 12 a 15      910000
7 Oct - Domingo 12 a 15     710000
7 Oct - Domingo 19 a 22     580000
7 Oct - Domingo 9 a 12        8000
8 Oct - Domingo 9 a 12        8000
9 Oct - Domingo 9 a 12        8000
Club Mate                    14000
Incentivo Domingo 8 a 13    160000
Incentivo Jueves 12 a 15   1694000
Incentivo Jueves 19 a 22   1120000
Incentivo Jueves 20 a 22    248000
Incentivo Jueves 8 a 12     216000
Incentivo Sabado 9 a 13     272000
incentivo 2018-09-28        176000

Probar Despues:
for i in df_calcGarantias.index:
    df_calcGarantias['garantia horas'][i] = getMonto(25,df_calcGarantias['hora'][i],3)

In [30]:
earn_res = df_earn.groupby('storekeeper_id')

In [31]:
earn_res = earn_res.total.sum()

In [32]:
df_ganancia = pd.DataFrame(earn_res)

In [33]:
df_ganancia.head(10)

                 total
storekeeper_id
10042            14975
10047            21800
10048           161800
10059           166825
10065            92225
10066           140175
10067           103410
10075            14000
10082           118450
10083            99950

In [34]:
df_debt[df_debt['storekeeper_id']==10042]

,dispersion_id,storekeeper_id,created_at,name,model_id,total
2294,348832,10042,2018-10-06 17:38:34.697,cash_base,267737,-347
62,329027,10042,2018-10-04 11:46:08.989,debt_by_balance,14,-1175

In [35]:
debt_res = df_debt.groupby(['storekeeper_id','name'])

In [36]:
debt_res = pd.DataFrame(debt_res.total.sum())

In [37]:
debt_res.head(10)

                                total
storekeeper_id name
10042          cash_base         -347
               debt_by_balance  -1175
10043          debt_by_balance -28000
10045          debt_by_balance  -2115
10046          debt_by_balance -12500
10047          cash_base        -2574
               debt_by_balance -58619
               pay_debt         75025
10048          cash_base       -66191
               pay_debt         94862

In [38]:
#Resumen total deuda
df_deuda = pd.DataFrame(debt_res)
df_deuda = df_deuda.groupby('storekeeper_id').total.sum()

In [39]:
df_deuda2 = pd.DataFrame(df_deuda)

In [40]:
df_deuda2.head(10)

                 total
storekeeper_id
10042            -1522
10043           -28000
10045            -2115
10046           -12500
10047            13832
10048            28671
10049          -351765
10050                0
10054           -14551
10057           -73963

In [41]:
df_earn[df_earn['storekeeper_id']==10059].sum()

storekeeper_id                                              1005900
name              tipservice_costtiptipservice_costtipservice_co...
model_id                                                   24883839
total                                                        166825
dtype: object

In [42]:
df_mandebt.head(10)

,storekeeper_id,created_at,id,amount,comment
63,10059,2018-10-05 09:50:57.003,5338,-100000,Carga de deuda por Daniel Alfaro
40,10640,2018-10-05 18:36:42.026,5361,-3600,pedido liberado y no entregado
44,10683,2018-10-05 16:55:33.147,5357,-30081,Se le deposito mas de lo que se debia. Revisad...
113,10702,2018-10-04 00:01:48.784,5288,-47400,Repartidor libera orden luego de cobrar al cli...
0,10894,2018-10-08 21:18:23.514,5401,-42160,no trae pedido a la oficina
98,10944,2018-10-04 18:04:45.001,5303,-38758,Rt tramita todo el proceso de la orden en 2 mi...
51,11262,2018-10-05 14:35:02.158,5350,-13980,Mal uso de App - castigo
97,11262,2018-10-04 18:40:01.086,5304,-15880,repartidor libera orden y no entrega
3,11757,2018-10-08 18:02:04.394,5398,-9400,Datos mal ingresados. MR
111,12000,2018-10-04 10:11:58.732,5290,-10490,Rt tramita orden y no entrega al cliente.

In [43]:
mandebt_res = df_mandebt.groupby(['storekeeper_id','comment'])

In [44]:
mandebt_res = mandebt_res.amount.sum()

In [45]:
#Resumen Deuda Manual por ID
df_dmanual = pd.DataFrame(mandebt_res)

In [46]:
df_mandebt[df_mandebt['storekeeper_id'] == 10336]

Empty DataFrame
Columns: [storekeeper_id, created_at, id, amount, comment]
Index: []

In [47]:
#Total Ganado Semana
df_ganancia['total'].values.ravel().sum()

42023573

In [48]:
#Total Cobros Semana
df_debt['total'].values.ravel().sum()

-53032195

In [49]:
df_final = pd.merge(df_ganancia,df_deuda2,how='outer',on = 'storekeeper_id')
df_final = df_final.fillna(0).sort_values('storekeeper_id')
df_final.insert(2,'Total a Pagar', df_final.total_x + df_final.total_y)

In [50]:
df_garantias = df_earn[df_earn['name']=='service_cost']

In [51]:
#Total Cobros Semana
df_debt['total'].values.ravel().sum()

-53032195

In [52]:
#Dataframe con Total de Ordenes por RT
df_ppay = df_garantias.groupby('storekeeper_id').total.count()
df_ppay2 = pd.DataFrame(df_ppay)
df_ppay2 = df_ppay2.reset_index()

In [53]:
df_debt[df_debt['name']=='order_not_delivered_manual_debt'].sort_values('storekeeper_id')

,dispersion_id,storekeeper_id,created_at,name,model_id,total
1867,341500,10640,2018-10-05 18:36:42.113,order_not_delivered_manual_debt,5361,-3600
0,328490,10702,2018-10-04 00:01:48.878,order_not_delivered_manual_debt,5288,-47400
3955,362141,10894,2018-10-08 21:18:23.616,order_not_delivered_manual_debt,5401,-42160
1210,333221,10944,2018-10-04 18:04:45.112,order_not_delivered_manual_debt,5303,-38758
1575,338970,11262,2018-10-05 14:35:02.313,order_not_delivered_manual_debt,5350,-13980
1234,333456,11262,2018-10-04 18:40:01.169,order_not_delivered_manual_debt,5304,-15880
38,328791,12000,2018-10-04 10:11:58.835,order_not_delivered_manual_debt,5290,-10490

In [54]:
df_final = df_final.rename(columns= {'total_x':'Total Produccion S/Garantias','total_y':'Total Deuda'})

In [55]:
df_final = df_final.reset_index()
df_final[df_final['storekeeper_id']==10736]

     storekeeper_id  Total Produccion S/Garantias  Total Deuda  Total a Pagar
301           10736                        1400.0          0.0         1400.0

In [56]:
writer = pd.ExcelWriter('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Resumen S'+semana+'.xlsx')
df_earn.to_excel(writer,'Resumen Ganancia')
df_debt.to_excel(writer,'Resumen Deuda')
df_final.to_excel(writer,'Prod-Deuda')
df_dmanual.to_excel(writer, 'Deuda Manual')
df_calcGarantias.to_excel(writer, 'Calculo Garantias')
df_garDias.to_excel(writer, 'Incentivos fin de Semana')
df_ppay2.to_excel(writer, 'Ordenes Totales')
df_resumen.to_excel(writer, 'Totales')
writer.save()
writer.close()

Agregar Glosa + Fecha para info que aparecera en la notificacion de la aplicacion.

In [57]:
dtrab.to_excel('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Dias Trabajados.xlsx')
df_final.to_excel('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Pagos S'+semana+'.xlsx')

In [58]:
df_incentivos.to_excel('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Detalle Incentivos.xlsx')

In [59]:
df_vina.to_excel('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Info Conexion '+semana+' - Viña.xlsx')